reynoldsNumberEffect/straightDiamond_1.9e6/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         40;

deltaT          0.005;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
forces
{
	type				forces;
	functionObjectLibs	("libforces.so");
	outputControl		timeStep;
	outputInterval		10;
	
	patches			("diamond");
	pName				p;
	UName				U;
	rho				rhoInf;
	log				true;
	CofR				(0 0 0);
	rhoInf			1.225;
}

forceCoeffs
{
	type				forceCoeffs;
	functionObjectLibs	("libforces.so");
	outputControl		timeStep;
	outputInterval		10;
	
	patches			("diamond");
	pName				p;
	UName				U;
	rho				rhoInf;
	log				true;
	liftDir			(0 1 0);
	dragDir			(1 0 0);
	CofR				(0 0 0);
	pitchAxis			(0 0 1);
	magUInf			1;
	rhoInf			1.225;
	lRef				1;
	Aref				2;
	
}

}

// ************************************************************************* //
